[
  {
    "bookId": 1001,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://raw.githubusercontent.com/MillatSakib/img-src/main/assignment8/The_Great_Gatsby.png",
    "review": "The Great Gatsby, written by F. Scott Fitzgerald, is a tragic story set in the Jazz Age of the 1920s. It revolves around Jay Gatsby, a wealthy and mysterious man, and his love for Daisy Buchanan, a married woman. The novel delves deep into themes of love, wealth, and betrayal, highlighting the emptiness of the American Dream and the consequences of living a life built on illusions. Fitzgerald's prose is mesmerizing, painting a vivid picture of the extravagant parties, societal decadence, and inner turmoil of the characters. The book's tragic ending serves as a poignant commentary on the human condition and the pursuit of happiness in a materialistic world.",
    "totalPages": 218,
    "rating": 4.5,
    "category": ["Fiction", "Drama"],
    "tags": ["Suspense", "Psychological"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 1002,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://raw.githubusercontent.com/MillatSakib/img-src/main/assignment8/To_Kill_a_Mockingbird.png",
    "review": "To Kill a Mockingbird, penned by Harper Lee, is a powerful narrative that confronts racial injustice in a Southern town during the 1930s. The story unfolds through the eyes of Scout Finch, a young girl, whose father, Atticus Finch, defends a black man falsely accused of raping a white woman. Through Scout's innocence and curiosity, the novel explores complex themes of morality, compassion, and the harsh realities of prejudice and discrimination. Harper Lee's masterful storytelling and vivid character development make this book a timeless classic, resonating with readers of all ages. It's a poignant reminder of the importance of empathy and standing up for what is right, even in the face of adversity.",
    "totalPages": 324,
    "rating": 4.8,
    "category": ["Fiction", "Social Justice"],
    "tags": ["Suspense", "Psychological"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 1003,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://raw.githubusercontent.com/MillatSakib/img-src/main/assignment8/The-Catcher-in-the-Rye.png",
    "review": "The Catcher in the Rye by J.D. Salinger is a compelling exploration of teenage angst and rebellion. The protagonist, Holden Caulfield, narrates his experiences after being expelled from prep school, reflecting on his alienation from society and his search for authenticity and meaning. The novel deals with themes of identity, alienation, and the loss of innocence, capturing the disillusionment many young people face as they navigate the complexities of adulthood. Salinger's writing style, characterized by Holden's distinctive voice and raw emotions, resonates with readers, making this novel a timeless coming-of-age classic.",
    "totalPages": 277,
    "rating": 4.3,
    "category": ["Fiction", "Coming of Age"],
    "tags": ["Suspense", "Psychological"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 1004,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://raw.githubusercontent.com/MillatSakib/img-src/main/assignment8/1984.png",
    "review": "1984 by George Orwell is a dystopian masterpiece that paints a chilling picture of a totalitarian regime's control over society. Set in a future where individuality is suppressed, and Big Brother watches everything, the novel follows Winston Smith as he rebels against the Party's oppressive rule. Through themes of surveillance, propaganda, and thought control, Orwell's prophetic vision warns of the dangers of authoritarianism and the erosion of freedom. 1984 remains a relevant and thought-provoking work, sparking discussions about government overreach, privacy rights, and the power of truth in the face of manipulation and deception.",
    "totalPages": 328,
    "rating": 4.6,
    "category": ["Fiction", "Dystopian"],
    "tags": ["Suspense", "Psychological"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 1005,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://raw.githubusercontent.com/MillatSakib/img-src/main/assignment8/Pride_and_Prejudice.png",
    "review": "Pride and Prejudice, written by Jane Austen, is a classic romantic novel that offers a witty and insightful commentary on societal norms and personal growth. The story follows Elizabeth Bennet as she navigates the complexities of love, marriage, and social status in Regency-era England. Austen's sharp wit, memorable characters, and keen observations of human nature make this novel a timeless favorite. Pride and Prejudice not only entertains with its romantic plot but also delves into themes of prejudice, pride, and the importance of understanding and self-awareness.",
    "totalPages": 279,
    "rating": 4.7,
    "category": ["Fiction", "Romance"],
    "tags": ["Suspense", "Psychological"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 1006,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://raw.githubusercontent.com/MillatSakib/img-src/main/assignment8/The_Hobbit.png",
    "review": "The Hobbit by J.R.R. Tolkien is an adventurous tale that takes readers on a journey with Bilbo Baggins, a hobbit who embarks on a quest to reclaim treasure guarded by the dragon Smaug. Along the way, Bilbo encounters trolls, elves, goblins, and a mysterious creature named Gollum. Tolkien's richly imagined world of Middle-earth, filled with magic, dwarves, and epic battles, captivates readers of all ages. The Hobbit not only entertains with its thrilling adventures but also explores themes of courage, friendship, and the power of unexpected heroism.",
    "totalPages": 310,
    "rating": 4.9,
    "category": ["Fantasy", "Adventure"],
    "tags": ["Suspense", "Psychological"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 1007,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "image": "https://raw.githubusercontent.com/MillatSakib/img-src/main/assignment8/Harry_Potter_and_the_Philosopher_Stone.png",
    "review": "Harry Potter and the Philosopher's Stone, the first book in the iconic series by J.K. Rowling, introduces readers to the magical world of Hogwarts School of Witchcraft and Wizardry. Follow Harry Potter, a young wizard, as he discovers his true identity, makes lifelong friends like Hermione Granger and Ron Weasley, and confronts the dark wizard Voldemort. Rowling's imaginative storytelling, enchanting characters, and richly detailed universe have captivated millions of readers worldwide. The book's themes of friendship, courage, and the battle between good and evil resonate with readers of all ages, making it a modern fantasy classic.",
    "totalPages": 320,
    "rating": 4.9,
    "category": ["Fantasy", "Magic"],
    "tags": ["Suspense", "Psychological"],
    "publisher": "Bloomsbury Publishing",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 1008,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://raw.githubusercontent.com/MillatSakib/img-src/main/assignment8/The_Lord_of_the_Rings.png",
    "review": "The Lord of the Rings, a fantasy epic by J.R.R. Tolkien, follows Frodo Baggins on his perilous quest to destroy the One Ring and save Middle-earth from the dark lord Sauron. Joined by a diverse fellowship including Aragorn, Legolas, and Gandalf the wizard, Frodo embarks on an epic journey fraught with danger and adventure. Tolkien's intricate world-building, rich mythology, and themes of heroism, sacrifice, and the battle against overwhelming odds have made The Lord of the Rings a cornerstone of fantasy literature. Its timeless appeal continues to inspire readers and fans of epic storytelling across generations.",
    "totalPages": 1178,
    "rating": 4.8,
    "category": ["Fantasy", "Epic"],
    "tags": ["Suspense", "Psychological"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1954
  }
]
